Revit 2026 API

# UVMultiply(UV, Double) Operator

---

The product of the specified number and the specified 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator *(
	UV left,
	double value
)
```
```vb
Public Shared Operator * (
	left As UV,
	value As Double
) As UV
```
```cpp
public:
static UV^ operator *(
	UV^ left,
	double value
)
```
```fsharp
static let inline (*)
        left : UV *
        value : float  : UV
```

#### Parameters

left UV
    The vector to multiply with the value.
value Double
    The value to multiply with the specified vector.

#### Return Value

UVThe multiplied 2-D vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |
| ArgumentNullException | Thrown when left is . |

The multiplied vector is obtained by multiplying each coordinate of the specified vector by the specified value.

#### Reference

UV Class

Multiply Overload

Autodesk.Revit.DB Namespace